cloudn1ne/Mowgli/stm32/ros_usbnode/src/main.c
    //HAL_UART_Receive_IT(&DRIVEMOTORS_USART_Handler, &drivemotors_rcvd_data, 1);    
    HAL_UART_Receive_DMA(&DRIVEMOTORS_USART_Handler, &drivemotors_rcvd_data, 1);
    debug_printf(" * Drive Motors UART DMX (TX/TX) enabled\r\n");

    HAL_UART_Receive_IT(&PANEL_USART_Handler, &panel_rcvd_data, 1);   // rearm interrupt               
    debug_printf(" * Panel Interrupt enabled\r\n");

    HAL_GPIO_WritePin(LED_GPIO_PORT, LED_PIN, 0);
    HAL_GPIO_WritePin(TF4_GPIO_PORT, TF4_PIN, 1);
    HAL_GPIO_WritePin(PAC5223RESET_GPIO_PORT, PAC5223RESET_PIN, 1);     // take Blade PAC out of reset if HIGH
    HAL_GPIO_WritePin(PAC5210RESET_GPIO_PORT, PAC5210RESET_PIN, 0);     // take Drive Motor PAC out of reset if LOW

    // send some init messages - needs further investigation, drivemotors are happy without it
    HAL_UART_Transmit(&DRIVEMOTORS_USART_Handler, drivemotors_init, 12, HAL_MAX_DELAY);
    HAL_Delay(100);
    HAL_UART_Transmit(&DRIVEMOTORS_USART_Handler, drivemotors_init, 12, HAL_MAX_DELAY);
    HAL_Delay(100);
    debug_printf(" * Drive Motors initialized\r\n");

    HAL_UART_Transmit(&BLADEMOTOR_USART_Handler, blademotor_init, 22, HAL_MAX_DELAY);
    HAL_Delay(100);
    HAL_UART_Transmit(&BLADEMOTOR_USART_Handler, blademotor_init, 22, HAL_MAX_DELAY);
    HAL_Delay(100);
    debug_printf(" * Blade Motor initialized\r\n");
    debug_printf(" * HW Init completed\r\n");    
    
    // read zero offset for charge current
    charge_current_offset = ADC_ChargeCurrent(10);
    debug_printf(" * Charge Current Offset: %2.2fA\r\n", charge_current_offset);

    // Initialize Main Timers
	NBT_init(&main_chargecontroller_nbt, 10);
    NBT_init(&main_statusled_nbt, 1000);
	NBT_init(&main_emergency_nbt, 10);
    debug_printf(" * NBT Main timers initialized\r\n");     

    // Initialize ROS
    init_ROS();
    debug_printf(" * ROS serial node initialized\r\n");     
    debug_printf("\r\n >>> entering main loop ...\r\n\r\n"); 
    // <chirp><chirp> means we are in the main loop 
    chirp(2);    
    while (1)
    {        
        chatter_handler();
        motors_handler();    
        panel_handler();
        spinOnce();                       
        if (drivemotors_rx_STATUS == RX_VALID)                    // valid frame received from DRIVEMOTORS USART
        {
            uint8_t direction = drivemotors_rx_buf[5];

            // we need to adjust for direction (+/-) !
            if ((direction & 0xc0) == 0xc0)
            {            
                left_direction = 1;
            }
            else if ((direction & 0x80) == 0x80)
            {
                left_direction = -1;
            }
            else
            {
                left_direction = 0;
            }
            if ( (direction & 0x30) == 0x30)
            {            
                right_direction = 1;
            }
            else if ( (direction & 0x20) == 0x20)
            {
                right_direction = -1;
            }
            else
            {
                right_direction = 0;
            }
                        
            left_encoder_val = (drivemotors_rx_buf[14]<<8)+drivemotors_rx_buf[13];
            right_encoder_val = (drivemotors_rx_buf[16]<<8)+drivemotors_rx_buf[15];

            /*
              Encoder value can reset to zero twice when changing direction
              2nd reset occurs when the speed changes from zero to non-zero
            */
            left_wheel_speed_val =  left_direction * drivemotors_rx_buf[6];
            if( left_direction == 0 || (left_direction != prev_left_direction) || (prev_left_wheel_speed_val == 0 && left_wheel_speed_val != 0) )
            {
                prev_left_encoder_val = 0;
            }
            left_encoder_ticks += left_direction * (left_encoder_val - prev_left_encoder_val);
            prev_left_encoder_val = left_encoder_val;
            prev_left_wheel_speed_val = left_wheel_speed_val;
            prev_left_direction = left_direction;

            right_wheel_speed_val =  right_direction * drivemotors_rx_buf[7];
            if( right_direction == 0 || (right_direction != prev_right_direction) || (prev_right_wheel_speed_val == 0 && right_wheel_speed_val != 0) )
            {
                prev_right_encoder_val = 0;
            }
            right_encoder_ticks += right_direction * (right_encoder_val - prev_right_encoder_val);
            prev_right_encoder_val = right_encoder_val;
            prev_right_wheel_speed_val = right_wheel_speed_val;
            prev_right_direction = right_direction;


            //if (drivemotors_rx_buf[5]>>4)       // stuff is moving
           // {
           //    msgPrint(drivemotors_rx_buf, drivemotors_rx_buf_idx);             
           // }                    
            drivemotors_rx_buf_idx = 0;
            drivemotors_rx_STATUS = RX_WAIT;                    // ready for next message                        
            HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);         // flash LED                         
        }     
        /* not used atm - we control the bot via ROS
        if (master_rx_STATUS == RX_VALID)                        // valid frame received by MASTER USART
        {
            
                int i;
                //debug_printf("master_rx_buf_crc = 0x%02x\r\n", master_rx_buf_crc);            
                //debug_printf("master_rx_CRC = 0x%02x\r\n", master_rx_CRC);            
                //debug_printf("master_rx_LENGTH = %d\r\n", master_rx_LENGTH);            
                debug_printf("tx: ");
                for (i=0;i<master_rx_buf_idx;i++)
                {
                    debug_printf(" %02x", master_rx_buf[i]);
                }            
                debug_printf("\r\n");
            

            // until we have some kind of protocol we discrimate what goes where simply by message length
            // drive motors always get a 12 byte message relayed
            if (master_rx_buf_idx == 12)
                HAL_UART_Transmit(&DRIVEMOTORS_USART_Handler, master_rx_buf, master_rx_buf_idx, HAL_MAX_DELAY);
            // blade motor always gets a 12 byte message relayed
            if (master_rx_buf_idx == 7)
                HAL_UART_Transmit(&BLADEMOTOR_USART_Handler, master_rx_buf, master_rx_buf_idx, HAL_MAX_DELAY);

