cloudn1ne/Mowgli/stm32/ros_usbnode/src/main.c
}

/**
  * Enable DMA controller clock
  */
void MX_DMA_Init(void)
{

   /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();
  __HAL_RCC_DMA2_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Channel6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel6_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel6_IRQn);
  /* DMA1_Channel7_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel7_IRQn);
  /* DMA2_Channel4_5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Channel4_5_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA2_Channel4_5_IRQn);

}


/*
 * Charge Current
 */
float ADC_ChargeCurrent(uint8_t adc_conversions)
{
    float_t adc_current;
    uint8_t i;
    uint32_t adc_val_sum;
    uint16_t adc_val;
    ADC_ChannelConfTypeDef sConfig = {0};

    // switch channel
    sConfig.Channel = ADC_CHANNEL_1; // PA1 Charge Current
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES_5;
    if (HAL_ADC_ConfigChannel(&ADC_Handle, &sConfig) != HAL_OK)
    {
       Error_Handler();
    }
    // do adc conversion
    adc_val_sum = 0;    
    for (i=0; i<adc_conversions; i++)
    {
        HAL_ADC_Start(&ADC_Handle);
        HAL_ADC_PollForConversion(&ADC_Handle, 200);
        adc_val_sum += (uint16_t) HAL_ADC_GetValue(&ADC_Handle);
        HAL_ADC_Stop(&ADC_Handle);
    }    
    adc_val = adc_val_sum/adc_conversions;
    // guessed from experiments, close enough to at least determine when the battery is charging
    adc_current= ((float)(adc_val/4095.0f)*3.3f - 2.5f) * 100/12.0;
    return(adc_current);
}


/*
 * Charge Voltage
 */
float ADC_ChargeVoltage(uint8_t adc_conversions)
{
    float_t adc_volt;
    uint8_t i;
    uint32_t adc_val_sum;
    uint16_t adc_val;

    ADC_ChannelConfTypeDef sConfig = {0};

    // switch channel
    sConfig.Channel = ADC_CHANNEL_2; // PA2 Charge Voltage
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES_5;
    if (HAL_ADC_ConfigChannel(&ADC_Handle, &sConfig) != HAL_OK)
    {
       Error_Handler();
    }
    // do adc conversion
    adc_val_sum = 0;    
    for (i=0; i<adc_conversions; i++)
    {
        HAL_ADC_Start(&ADC_Handle);
        HAL_ADC_PollForConversion(&ADC_Handle, 200);
        adc_val_sum += (uint16_t) HAL_ADC_GetValue(&ADC_Handle);
        HAL_ADC_Stop(&ADC_Handle);
    }    
    adc_val = adc_val_sum/adc_conversions;
    adc_volt= (float)(adc_val/4095.0f)*3.3f*16;     //PA2 has a 1:16 divider
    return(adc_volt);
}


/*
 * Battery Voltage
 */
float ADC_BatteryVoltage(uint8_t adc_conversions)
{
    float_t adc_volt;
    uint8_t i;
    uint32_t adc_val_sum;
    uint16_t adc_val;

    ADC_ChannelConfTypeDef sConfig = {0};

    // switch channel
    sConfig.Channel = ADC_CHANNEL_3; // PA3 Battery
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES_5;
    if (HAL_ADC_ConfigChannel(&ADC_Handle, &sConfig) != HAL_OK)
    {
       Error_Handler();
    }
    // do adc conversion
    adc_val_sum = 0;    
    for (i=0; i<adc_conversions; i++)
    {
        HAL_ADC_Start(&ADC_Handle);
        HAL_ADC_PollForConversion(&ADC_Handle, 200);
        adc_val_sum += (uint16_t) HAL_ADC_GetValue(&ADC_Handle);
        HAL_ADC_Stop(&ADC_Handle);
    }    
    adc_val = adc_val_sum/adc_conversions;
    adc_volt= (float)(adc_val/4095.0f)*3.3f*10 + 0.3;  //PA3 has a 1:10 divider - and there is a 0.3V drop between Bat and ADC
    return(adc_volt);
}

/*
 * ADC test code to sample PA2 (Charge) and PA3 (Battery) Voltage
 */
void ADC_Test()
{
    float_t adc_volt;
    uint16_t adc_val;
    ADC_ChannelConfTypeDef sConfig = {0};

        // switch channel
        sConfig.Channel = ADC_CHANNEL_3; // PA3 Battery
        sConfig.Rank = ADC_REGULAR_RANK_1;
        sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES_5;
        if (HAL_ADC_ConfigChannel(&ADC_Handle, &sConfig) != HAL_OK)
        {
            Error_Handler();
        }
        // do adc conversion
        HAL_ADC_Start(&ADC_Handle);
        HAL_ADC_PollForConversion(&ADC_Handle, 200);
        adc_val = (uint16_t) HAL_ADC_GetValue(&ADC_Handle);
        HAL_ADC_Stop(&ADC_Handle);
        adc_volt= (float)(adc_val/4095.0f)*3.3f*10;  //PA3 has a 1:10 divider
        debug_printf("Battery Voltage: %2.2fV (adc:%d)\r\n", adc_volt, adc_val);

        // switch channel
        sConfig.Channel = ADC_CHANNEL_2; // PA2 Charge
        sConfig.Rank = ADC_REGULAR_RANK_1;
        sConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES_5;
        if (HAL_ADC_ConfigChannel(&ADC_Handle, &sConfig) != HAL_OK)
        {
            Error_Handler();
        }
        // do adc conversion
        HAL_ADC_Start(&ADC_Handle);
        HAL_ADC_PollForConversion(&ADC_Handle, 200);
        adc_val = (uint16_t) HAL_ADC_GetValue(&ADC_Handle);
        HAL_ADC_Stop(&ADC_Handle);
        adc_volt= (float)(adc_val/4095.0f)*3.3f*16;     //PA2 has a 1:16 divider
        debug_printf(" Charge Voltage: %2.2fV (adc:%d)\r\n", adc_volt, adc_val);
        debug_printf("\r\n");
  
}

/*
 * manaes the charge voltage, and charge, lowbat LED
 * needs to be called frequently
 */
void ChargeController(void)
{                        
        charge_voltage =  ADC_ChargeVoltage(5);                    
        battery_voltage = ADC_BatteryVoltage(5);
        charge_current = ADC_ChargeCurrent(5) - charge_current_offset;
        if (charge_current < 0)
            charge_current = 0;
        
        if (charge_voltage >= MIN_CHARGE_VOLTAGE ) {
            // set PWM to approach 29.4V charge voltage
            if ((charge_voltage < 29.4) && (chargecontrol_pwm_val < 1350))
            {
                chargecontrol_pwm_val++;
            }            
            if ((charge_voltage > 29.4) && (chargecontrol_pwm_val > 50))
            {
                chargecontrol_pwm_val--;
            }
            // cap charge current at 1.0 Amps
            if (charge_current > MAX_CHARGE_CURRENT)
            {
                chargecontrol_pwm_val--;
            }
        }
        else {
             chargecontrol_pwm_val = MIN_CHARGE_PWM;    
             // constantly get fresh offet if we are not charging      
             if (charge_voltage == 0)
             {
                charge_current_offset = ADC_ChargeCurrent(5);
             }
        }        
        TIM1->CCR1 = chargecontrol_pwm_val;  
}

