cloudn1ne/Mowgli/stm32/ros_usbnode/src/main.c
/*
 * Manages the emergency sensors
 */
void EmergencyController(void)
{
    GPIO_PinState stop_button_yellow = HAL_GPIO_ReadPin(STOP_BUTTON_YELLOW_PORT, STOP_BUTTON_YELLOW_PIN);
    GPIO_PinState stop_button_white = HAL_GPIO_ReadPin(STOP_BUTTON_WHITE_PORT, STOP_BUTTON_WHITE_PIN);
    GPIO_PinState wheel_lift_blue = HAL_GPIO_ReadPin(WHEEL_LIFT_BLUE_PORT, WHEEL_LIFT_BLUE_PIN);
    GPIO_PinState wheel_lift_red = HAL_GPIO_ReadPin(WHEEL_LIFT_RED_PORT, WHEEL_LIFT_RED_PIN);
    GPIO_PinState tilt = HAL_GPIO_ReadPin(TILT_PORT, TILT_PIN);
    GPIO_PinState play_button = !HAL_GPIO_ReadPin(PLAY_BUTTON_PORT, PLAY_BUTTON_PIN); // pullup, active low    
    uint8_t accelerometer_int_triggered = I2C_TestZLowINT();

    uint32_t now = HAL_GetTick();

    if (stop_button_yellow || stop_button_white)
    {
        if (stop_emergency_started == 0)
        {
            stop_emergency_started = now;
        }
        else
        {
            if (now - stop_emergency_started >= STOP_BUTTON_EMERGENCY_MILLIS)
            {
                if (stop_button_yellow)
                {
                    emergency_state |= 0b00010;
                    debug_printf(" ## EMERGENCY ## - STOP BUTTON (yellow) triggered\r\n");
                }
                if (stop_button_white) {
                    emergency_state |= 0b00100;
                    debug_printf(" ## EMERGENCY ## - STOP BUTTON (white) triggered\r\n");
                }
            }
        }
    }
    else
    {
        stop_emergency_started = 0;
    }

    if (wheel_lift_blue || wheel_lift_red)
    {
        if (wheel_lift_emergency_started == 0)
        {
            wheel_lift_emergency_started = now;
        }
        else
        {
            if (now - wheel_lift_emergency_started >= WHEEL_LIFT_EMERGENCY_MILLIS)
            {
                if (wheel_lift_blue)
                {
                    emergency_state |= 0b01000;
                    debug_printf(" ## EMERGENCY ## - WHEEL LIFT (blue) triggered\r\n");
                }
                if (wheel_lift_red)
                {
                    emergency_state |= 0b10000;
                    debug_printf(" ## EMERGENCY ## - WHEEL LIFT (red) triggered\r\n");
                }
            }
        }
    }
    if (accelerometer_int_triggered)
    {
        if(accelerometer_int_emergency_started == 0)
        {
            accelerometer_int_emergency_started = now;
        }
        else
        {
            if (now - accelerometer_int_emergency_started >= TILT_EMERGENCY_MILLIS) {
                emergency_state |= 0b100000;
                debug_printf(" ## EMERGENCY ## - ACCELEROMETER TILT triggered\r\n");
            }
        }     
    }
    else
    {
        accelerometer_int_emergency_started = 0;
    }
    
    if (tilt)
    {
        if(tilt_emergency_started == 0)
        {
            tilt_emergency_started = now;
        }
        else
        {
            if (now - tilt_emergency_started >= TILT_EMERGENCY_MILLIS) {
                emergency_state |= 0b100000;
                debug_printf(" ## EMERGENCY ## - MECHANICAL TILT triggered\r\n");
            }
        }
    }
    else
    {
        tilt_emergency_started = 0;
    }

    if (emergency_state && play_button)
    {
        if(play_button_started == 0)
        {
            play_button_started = now;
        }
        else
        {
            if (now - play_button_started >= PLAY_BUTTON_CLEAR_EMERGENCY_MILLIS) {
                emergency_state = 0;
                debug_printf(" ## EMERGENCY ## - manual reset\r\n");
				StatusLEDUpdate();
                chirp(1);
            }
        }
    }
    else
    {
        play_button_started = 0;
    }
}

/*
 * Update the states for the Emergency, Charge and Low Bat LEDs
 */
void StatusLEDUpdate(void)
{
        if (emergency_state) {
            PANEL_Set_LED(PANEL_LED_LIFTED, PANEL_LED_FLASH_FAST);
        } else {
            PANEL_Set_LED(PANEL_LED_LIFTED, PANEL_LED_OFF);
        }

        if ((charge_voltage >= MIN_CHARGE_VOLTAGE) && (charge_current >= MIN_CHARGE_CURRENT))         // we are charging ...
        {
            // indicate charging by flashing fast if we are plugged in
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_FLASH_FAST);
            chargecontrol_is_charging = 1;
        }
        else
        {
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_OFF);
            chargecontrol_is_charging = 0;
        }
            
        // show a lowbat warning if battery voltage drops below LOW_BAT_THRESHOLD ? (random guess, needs more testing or a compare to the stock firmware)            
        // if goes below LOW_BAT_THRESHOLD-1 we increase led flash frequency        
        if (battery_voltage <= LOW_BAT_THRESHOLD)
        {
            PANEL_Set_LED(PANEL_LED_BATTERY_LOW, PANEL_LED_FLASH_SLOW); // low
        }
        else if (battery_voltage <= LOW_BAT_THRESHOLD-1.0)
        {
            PANEL_Set_LED(PANEL_LED_BATTERY_LOW, PANEL_LED_FLASH_FAST); // really low
        }
        else
        {
            PANEL_Set_LED(PANEL_LED_BATTERY_LOW, PANEL_LED_OFF); // bat ok
        }                
        debug_printf(" > Chg Voltage: %2.2fV | Chg Current: %2.2fA (offset: %2.2fA) | PWM: %d | Bat Voltage %2.2fV\r\n", charge_voltage, charge_current, charge_current_offset,  chargecontrol_pwm_val, battery_voltage);                           
}

/*
 * Send message to DriveMotors PAC
 *
 * <xxx>_speed = 0x - 0xFF
 * <xxx>_dir = 1 = CW, 1 != CCW
 */
void setDriveMotors(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{
    uint8_t direction = 0x0;            
    static uint8_t drivemotors_msg[DRIVEMOTORS_MSG_LEN] =  { 0x55, 0xaa, 0x8, 0x10, 0x80, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0};
    
    drivemotors_msg[5] = direction;
    drivemotors_msg[6] = left_speed;
    drivemotors_msg[7] = right_speed;

    // calc direction bits
    if (right_dir == 1)
    {        
        direction |= (0x20 + 0x10);
    }
    else
    {
        direction |= 0x20;
    }
    if (left_dir == 1)
    {   
        direction |= (0x40 + 0x80);                             
    }
    else
    {
        direction |= 0x80;
    }
    // update direction byte in message
    drivemotors_msg[5] = direction;
    // calc crc
    drivemotors_msg[DRIVEMOTORS_MSG_LEN-1] = crcCalc(drivemotors_msg, DRIVEMOTORS_MSG_LEN-1);    
  // msgPrint(drivemotors_msg, DRIVEMOTORS_MSG_LEN);
    // transmit via UART
    DRIVEMOTORS_Transmit(drivemotors_msg, DRIVEMOTORS_MSG_LEN);
    // HAL_UART_Transmit(&DRIVEMOTORS_USART_Handler, drivemotors_msg, DRIVEMOTORS_MSG_LEN, HAL_MAX_DELAY);
     //HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler, drivemotors_msg, DRIVEMOTORS_MSG_LEN);
}

